> **Describe the bug** We're trying to manage repositories on an Artifactory Edge instance, they're a little bit special in that they only support smart remotes (Artifactory to Artifactory) rather than simply any type of remote. It seems the provider is unable to manage repositories of this type - see the output below. Looking at the network calls in Chrome developer mode when you using the UI it appears that creation of the smart remote is just a POST to /repositories and nothing more special than that.
> 
> ```shell
> $ tf apply
> 
> Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # artifactory_remote_docker_repository.smart_remote will be created
>   + resource "artifactory_remote_docker_repository" "smart_remote" {
>       + allow_any_host_auth                     = (known after apply)
>       + assumed_offline_period_secs             = 300
>       + blacked_out                             = (known after apply)
>       + block_mismatching_mime_types            = (known after apply)
>       + block_pushing_schema1                   = (known after apply)
>       + bypass_head_requests                    = (known after apply)
>       + client_tls_certificate                  = (known after apply)
>       + description                             = (known after apply)
>       + enable_cookie_management                = (known after apply)
>       + enable_token_authentication             = (known after apply)
>       + excludes_pattern                        = (known after apply)
>       + external_dependencies_enabled           = true
>       + failed_retrieval_cache_period_secs      = (known after apply)
>       + hard_fail                               = (known after apply)
>       + id                                      = (known after apply)
>       + includes_pattern                        = (known after apply)
>       + key                                     = "my_smart_remote"
>       + missed_cache_period_seconds             = (known after apply)
>       + offline                                 = (known after apply)
>       + package_type                            = (known after apply)
>       + password                                = (sensitive value)
>       + priority_resolution                     = (known after apply)
>       + propagate_query_params                  = false
>       + property_sets                           = [
>           + "artifactory",
>         ]
>       + proxy                                   = (known after apply)
>       + remote_repo_layout_ref                  = (known after apply)
>       + repo_layout_ref                         = "simple-default"
>       + retrieval_cache_period_seconds          = 7200
>       + share_configuration                     = (known after apply)
>       + socket_timeout_millis                   = (known after apply)
>       + store_artifacts_locally                 = (known after apply)
>       + synchronize_properties                  = true
>       + unused_artifacts_cleanup_period_enabled = (known after apply)
>       + unused_artifacts_cleanup_period_hours   = (known after apply)
>       + url                                     = "https://XXX"
>       + username                                = "XXX"
>       + xray_index                              = (known after apply)
> 
>       + content_synchronisation {
>           + enabled = true
>         }
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> ╷
> │ Warning: Experimental feature "module_variable_optional_attrs" is active
> │
> │   on provider.tf line 3, in terraform:
> │    3:   experiments      = [module_variable_optional_attrs]
> │
> │ Experimental features are subject to breaking changes in future minor or patch releases, based on feedback.
> │
> │ If you have feedback on the design of this feature, please open a GitHub issue to discuss it.
> ╵
> 
> Do you want to perform these actions?
>   Terraform will perform the actions described above.
>   Only 'yes' will be accepted to approve.
> 
>   Enter a value: yes
> 
> artifactory_remote_docker_repository.smart_remote: Creating...
> ╷
> │ Error:
> │ 400 PUT https://XXX/artifactory/api/repositories/my_smart_remote
> │ {
> │   "errors" : [ {
> │     "status" : 400,
> │     "message" : "Only smart remote repositories are supported with Artifactory Edge license\n"
> │   } ]
> │ }
> │
> │   with artifactory_remote_docker_repository.smart_remote,
> │   on provider.tf line 17, in resource "artifactory_remote_docker_repository" "smart_remote":
> │   17: resource "artifactory_remote_docker_repository" "smart_remote" {
> ```
> 
> ```shell
> terraform {
>   required_version = "1.1.1"
>   experiments      = [module_variable_optional_attrs]
>   required_providers {
>     artifactory = {
>       source = "jfrog/artifactory"
>     }
>   }
> }
> 
> provider "artifactory" {
>   url           = var.artifactory_url
>   access_token  = var.artifactory_access_token
>   check_license = var.check_license
> }
> 
> resource "artifactory_remote_docker_repository" "smart_remote" {
> 
>   key                           = "my_smart_remote"
>   repo_layout_ref               = "simple-default"
>   property_sets                 = ["artifactory"]
>   external_dependencies_enabled = true
>   url                           = "https://XXX"
>   username                      = "XXX"
>   password                      = "XXX"
>   synchronize_properties        = true
>   content_synchronisation {
>     enabled = true
>   }
> 
> 
>   lifecycle {
>     ignore_changes = [password]
>   }
> 
> }
> ```
> 
> Terraform 1.1 Artifactory: "version" : "7.31.10", "revision" : "73110900",
> 
> **Requirements for and issue**
> 
> * [x]  A fully functioning terraform snippet that can be copy&pasted (no outside files or ENV vars unless that's part of the issue)
> * [x]  Your version of artifactory (you can `curl` it at `$host/artifactory/api/system/version`
> * [x]  Your version of terraform
> 
> **Expected behavior** I would expect a smart remote to be manageable the same way as a regular remote.
> 
> ## **Additional context**

